# 7_out.py
# ------------------------------------
# n人围圈报数，7的倍数退出，循环至最后一人
# ------------------------------------
# jackkii    2019/03/18
# ------------------------------------
# 第一次修改   将int()换成eval()
#            使用len()代替变量n
#               20190320
# -------------------------------------
# 第二次修改   修改格式
#             #后加一个空格
#               20190329
# 第三次修改   改进
#               20190523


n = eval(input())       # 将input输入的字符串转换为int型
nn = list(x+1 for x in range(n))    # 列表nn储存初始编号
count1=1               # 计数7

while(len(nn) != 0):
    for i in range(len(nn)):    # 移动到下一个编号
        count1 = count1 % 7     # 重置counter
        if count1 == 0:     
            print(nn[i])        # 打印出元素原来的编号
            nn.pop(i)           # 移除
        count1 = count1 +1      # 计数加一      
